""""Задача 3 (средне) "Школьная загадка":

Напишите в начале программы однострочный комментарий: "3rd program".
Выведите на экран(в консоль) 2 умноженное на 2 плюс 2 без приоритета.
Выведите на экран(в консоль) 2 умноженное на 2 плюс 2 с приоритетом для сложения.
Выведите на экран(в консоль) результат сравнения этих двух выражений.
Предполагаемый результат (с использованием ==): False"""

#3rd program
print(2*2+2)
print(2*(2+2))
print(2*2+2==2*(2+2))

print(2*2+2, 2*(2+2), 2*2+2==2*(2+2))